# SourceInUnloadedLink Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DPartFailures..::..SourceInUnloadedLink Property
BuiltInFailures..::..DPartFailures Class See Also
---
Some elements already have parts
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SourceInUnloadedLink { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SourceInUnloadedLink As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SourceInUnloadedLink {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DPartFailures Class
Autodesk.Revit.DB Namespace